["RT @wklumpen: Hi @nenshi, I'll be moderating the Green Line Speaker Series at the Glenbow Theatre, Sep 20 at 5:30, can you RT?\nhttps://t.co…", "This week we look at different transit fare structures, and suggest a distance based scheme for #yyctransit https://t.co/TboAZl8hNg", "We're back with a new article! Looking at some reactions to recent news about commuting habits.\nhttps://t.co/LKWZifPpI5", "New article drops tomorrow!", "Hi folks, we're taking a summer break. We'll be back with more Calgary talk in September! #yyccc #yyc", "Some inspiration for #yyc from Shanghai of all places. Mobility = Freedom everywhere https://t.co/mmrqgDVaKf", "While #yyccc catches their breath for 30 minutes, sounds like some ppl could brush up on induced demand https://t.co/vvMiwZdMWf", "Digging into congestion costs https://t.co/Wa03pNW43I", "RT @YYCTRGM: Terrible driving all over the place this AM. Come on Calgary the rodeo is on the grounds not the streets.", "@GregGinYYC We await with bated breath, though there's plenty of time as it won't go up for a few weeks.", "@spuryyc @GregGinYYC Specifically on an article about how city council works, to illustrate a point on \"voting record\"", "@GregGinYYC do you mind if we use some of your charts from your website? Looking at these: https://t.co/B3UCgUmq6B", "All transportation systems need a \"critical network\" to become more than the sum of its parts. https://t.co/uMvxASN9qz", "RT @bpincott: @peterloliver @khancept31 That is the level of service provided in the SW &amp; exactly why we need the #SWBRT #yyc4brt", "@HainesDanny Find that people generally relate to those types of distances in feet. Should have provided both, in retrospect.", "@Chealion Welcome!", "The cannon next door to item 8.16 #yyccc https://t.co/cJmqNvYcHd", "@calgarytransit Yes, exactly - high coverage. Always an interesting discussion: https://t.co/Wdajkeebcg", "#yyccc \"Transit close by\" applies pretty much everywhere in the city, since @calgarytransit focuses heavily on coverage.", "@nenshi and @BigRedyyc recognise the problem that \"databases that don't talk to each other\". This is a fixable issue! #yyccc", "#yyccc Coming up: agenda item 7.3 Streetview at 20\nMaple Court Crescent SE @nenshi https://t.co/kGHGH0r1lJ", "#yyccc Agenda Item 7.2 streetview: https://t.co/EGZBwRjPs8", "Got a post coming up that @gccarra might like called \"it takes a network\". Stay tuned! #yyccc @YYC4BRT", "We look at how planners default to the status-quo of \"cars first\", even when there is no reason to do so\nhttps://t.co/Um4hBSHyEV #yyc #yyccc", "@CouncillorKeats Thanks for clarifying your stance. Updated the article to reflect that.", "The simple but powerful concept of \"induced demand\". https://t.co/G0CrNW87ZH #yyc #yyccc", "RT @stephchd: @spuryyc nose hill at scenic acres Blvd. https://t.co/65u0FG6rAM", "@stephchd Yup!", "RT @cityofcalgary: It's the cycle track network pilot project 1yr anni &amp; we've seen 770,393 #yycbike trips in just 3 locations! https://t.c…", "\"A desire named streetcar\". Discussing streetcars in Calgary as city-shapers, not just people-movers. https://t.co/iH4PtjCzBx #yyctransit", "Fun fact: \"In Camera\" can be rearranged to spell \"American\" #InCameraBoredom #yyccc", "Public speakers pushing against elevated rail on #GreenLineYYC Totally agree. #yyccc", "Now @EWoolleyWard8 is making inadvertent rock puns. Gotta keep it lively! #yyccc", "@CBCScott Glad he's asking the important questions!", "Hopefully we don't have the same problem Bertha did in Seattle. #yyccc", "Lease or buy the tunnel machine? @seanchucalgary asking the important questions. #yyccc", "You can't out-design geometry. Elevated LRT to underground station transfer is simply more cumbersome. #GreenLineYYC #yyccc", "\"Do it right the first time\" was part of the public feedback on #GreenLineYYC. Probably true, giving favourable funding. #yyccc", "Tunnels are fascinating. Rock on, @peterdemong. #yyccc", "Under the river would be very very deep. Montreal metro has that issue going up the hill. Long escalator rides! #yyccc", "\"Compliments Calgary's downtown vibrancy\". How vibrant us our downtown really? #yyccc", "Watching these individual scores on specifics for #GreenLineYYC seems both arbitrary and robust at the same time.  #yyccc", "Sorry @ABDanielleSmith, elevated LRT ranked lowest for community well-being #yyccc", "Learning about the process behind admin. recommendations on the #GreenLineYYC options thru downtown. Lots of aggregation! #yyccc", "Always fun when not everyone at a #yyccc meeting is wearing business attire.", "Focus of today's meeting is the LRT downtown Let's see what they say about the streetscape aspect of #GreenLineYYC  #yyccc", "We're at City Hall today learning about #GreenLineYYC. Lots of information to come! #yyc #yyccc", "Looking for photo submissions of places in #yyc you think could be better with some simple improvements. Send to editor@spuryyc.org!", "New article on \"Re-imagining light rail\" #yyctransit\n\nhttps://t.co/rEABoXIZFn", "@BikeBikeYYC Uh huh, and look how successful that turned out!", "Bonus article! \"The fallacy of vocal dissent on the #swbrt\nhttps://t.co/I9Pea37DIH #yyc #yyctransit", "Today's article looks at shapes, and #yyc's obsession with circular neighbourhoods #yyccc: https://t.co/1RXBisEt46", "Today, a quick look at the 61 Avenue improvements near Chinook: https://t.co/L9mTXVaBOW #yyc #yycwalk", "RT @ahayher: #yyccc should take a page from Seattle and create great public spaces for citizens to enjoy. #yyc https://t.co/txqqBFajLO", "RT @calgaryxyz: Inner-city fenced dog park in Beltline a first for Calgary. https://t.co/ELPemIHr5b https://t.co/2JukQwDCqg", "A solid look at Calgary's Downtown and the long-term dangers of its off-work vacuum. #yyc #iamdowntown https://t.co/sPi1E93EII", "Good morning #yyc. New article coming at 11 on Calgary's downtown: is it functional?", "@tombielecki Plenty of streets in YYC have FT access and are not so wide. NYC also didn't have an issue when they narrowed roads.", "With the #GreenLineYYC #Beltline open house tomorrow, here's some thoughts you might be interested in https://t.co/JErDUYDjHw", "Here's today's article. Speed traps pointing to possible over-engineered roads. #yyc #yycwalk #yyccc https://t.co/idX93gd3KL", "It's Tuesday! Gonna drop a fresh article at 11. Stay tuned!", "A little teaser from one of next week's articles. Any guesses? #yyccc #yyc #yycwalk https://t.co/yQCCifSEiL", "@robdickinsonAB That's part of the plan - not all Qs are answerable based on what's there but many are.", "@robdickinsonAB We're looking to compile a \"everything about the #SWBRT similar to this article on Hamilton's LRT https://t.co/kZp08nk0Zd", "@nenshi @crackmacs We're hoping to give solid answers to good questions about the #SWBRT and clear up some myths. Send them in! #yyccc", "\"Let's not suddenly forget what makes good cities great\" - A calm look at robot-cars, inspired by @gccarra https://t.co/2gYBJQCeZL", "@GlenFCochrane With new technology we should always ask \"Wait. Do we really need this?\" - this one isn't so clear.", "Take a big-picture look at Calgary with \"Cities Served Three Ways\" by Ryan Plestid #yyc #yycplan #yyccc https://t.co/q8udp0K4gB", "Happy holiday! This week we've got some great articles in the works, including robot-car talk inspired by @gccarra. Stay tuned! #yyc #yyccc", "In case you missed the discussion on the #GreenLineYYC in the Centre City, here it is again: https://t.co/cpk2tBKoUG #yyc #yyccc #yyctransit", "And today's regular content: Playing with the street!\n\nhttps://t.co/RiB0o9ji21", "Bonus content! What all this \"100% reserved park and ride\" really means. Spoiler: it's not that bad #yyccc https://t.co/d69FKnJa3O", "\"Why Calgarians don't love YYC transit\" by @JenBurgess1 https://t.co/LiW8dqTJWw #yyc #iloveyyctransit", "Great set of articles coming this week! We'll hear from @JenBurgess1 and see how we can play with the streets for the new #GreenLineYYC #yyc", "RT @LRTontheGreen: Another reminder why #greenlineyyc offering an alternative to Deerfoot Tr is so important to SE #yyc neighbourhoods. htt…", "Got that sweet @nenshi RT! https://t.co/a5XjLe07FX", "@karinkeefe They're everywhere, just like people!", "We're now on Facebook! https://t.co/zmSrQWjD3q", "Hey #yyc #yyccc we'd love to see pictures of #desirelines all over Calgary. Tweet 'em at us! @nenshi @Crackmacs https://t.co/sdVBErTmrt", "@amanda_en_ciel @UCalgary if that's what the people want.... ;)", "New posts coming Tuesday/Thursday! This one's about Calgary's \"hidden desire lines\" #yyc #yyccc #yycwalk https://t.co/sdVBErTmrt", "We're gearing up to publish regular content! Be part of the conversation, and consider submitting something. #yyc #yyccc", "@BrianPansky @yycconnects we do now! Sounds very interesting indeed!", "RT @ABDanielleSmith: Intv w/ @wklumpen @UCalgary SchulickENGG on Green Line option https://t.co/fpThsYGIDZ #yyccc #yyc", "Spur contributor @wklumpen is talking Green Line today with @ABDanielleSmith! 1pm on @NewsTalk770. Tune in! #yyctransit #yyccc", "Green Line: mobility tool, or commuter service?https://t.co/JErDUYDjHw", "With a big transit meeting tomorrow, here's some clarification on the SW BRT budget: https://t.co/9YbeOuhFda #yyc", "@PhilWilsn @nenshi Love it. We're trying to create well-reasoned dialogue, goes hand in hand with supporting initiatives.", "@nenshi Trying to create a space where Calgarians can talk about making Calgary a better city. Looking for submissions! RT? @spuryyc #yyc", "One of our articles is being discussed on @NewsTalk770 this afternoon with @ABDanielleSmith! Tune in at 2:30: https://t.co/DFj92zKuEB", "The follies of Park and Ride. https://t.co/DFj92zKuEB #yyc #yyctransit", "@JenBurgess1 I think you might be interested in contributing - check us out at https://t.co/Ov1LpH0bMo", "Convenience barriers and \"social profit margins\" by Ryan Plestid:\nhttps://t.co/5dQcFO1BhS", "CalgaryNEXT misses the mark: https://t.co/INZ9dE7aXP #yyc #Flames #CalgaryNext", "@BrianPansky Great minds think alike! Look forward to your submissions!", "A take on imrpoving existing Beltline parks instead of adding new ones https://t.co/9FMkKyoiKi #yyc #yycplan #beltline", "Spuryyc article being discussed this afternoon! #yyc #SWBRT  https://t.co/FACRhzFBg5", "Article on the New Urban Farming Partnerships: Great initiative, check them out! #yyc #yycfood https://t.co/h7U9NUnGKJ", "Social exclusion and \"diversity annihilation\" in East Village: https://t.co/TaAtDW5KfI", "Does Calgary suffer from \"quadrant favouritism\"? @CRiabko discusses in new article: https://t.co/AUVJ0AHklY #yyc #editorial", "RT @metrocalgary: From critical, to critiquing - a more nuanced look at the SW BRT plan https://t.co/ooJZutjoN6 #yyc https://t.co/vu12GmjHy8", "RT @modacitylife: “It’s not about making all cities like Amsterdam. \nIt’s about making them better versions of themselves.” https://t.co/Cs…", "Calgary Transitway BRT article featured in @metrocalgary!", "One way bad, two way good? New article on Calgary's one way streets:\nhttps://t.co/tkz6EWBAtR #yyc", "The website has launched! Please consider contributing at https://t.co/BBihkYqElT #yyc"]